server/tests/load/artillery.yml
config:
  target: 'http://localhost:3000'
  phases:
    # Morning class start - peak attendance recording
    - duration: 300  # 5 minutes of peak activity
      arrivalRate: 100  # High concurrent users
      name: "Morning Class Start Peak"
    # Normal class time - moderate activity
    - duration: 1800  # 30 minutes
      arrivalRate: 30
      name: "Normal Class Activity"
    # Lunch break - low activity
    - duration: 600  # 10 minutes
      arrivalRate: 5
      name: "Lunch Break Low Activity"
    # Afternoon class start - another peak
    - duration: 300  # 5 minutes
      arrivalRate: 100
      name: "Afternoon Class Start Peak"
    # End of day - final attendance rush
    - duration: 300  # 5 minutes
      arrivalRate: 80
      name: "End of Day Attendance Rush"
    # Evening monitoring - low activity
    - duration: 600  # 10 minutes
      arrivalRate: 10
      name: "Evening Monitoring"
    # Device connection simulation - IoT devices connecting
    - duration: 120  # 2 minutes
      arrivalRate: 200  # Many devices connecting simultaneously
      name: "IoT Device Mass Connection"
    # Stress test - maximum load
    - duration: 180  # 3 minutes
      arrivalRate: 300  # Extreme load
      name: "System Stress Test"
    # Recovery and monitoring
    - duration: 300  # 5 minutes
      arrivalRate: 15
      name: "Recovery Monitoring"
  defaults:
    headers:
      Authorization: "Bearer {{ auth_token }}"
  processor: "./artillery-processor.js"

scenarios:
  # Authentication scenarios - different user types
  - name: "Faculty Login"
    weight: 8
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "faculty{{ $randomInt(1, 50) }}@school.edu"
            password: "password123"
          expect:
            - statusCode: 200
          capture:
            json: "$.token"
            as: "auth_token"

  - name: "Student Login"
    weight: 12
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "student{{ $randomInt(1, 1000) }}@school.edu"
            password: "password123"
          expect:
            - statusCode: 200
          capture:
            json: "$.token"
            as: "auth_token"

  - name: "Admin Login"
    weight: 3
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "admin@school.edu"
            password: "admin123"
          expect:
            - statusCode: 200
          capture:
            json: "$.token"
            as: "auth_token"

  # Peak attendance scenarios - high weight during class times
  - name: "Bulk Manual Attendance Entry"
    weight: 35
    flow:
      - post:
          url: "/api/attendance/manual"
          headers:
            Authorization: "Bearer {{ auth_token }}"
          json:
            studentId: "{{ $randomInt(1, 1000) }}"
            classSessionId: "{{ $randomInt(1, 50) }}"
            entryTime: "{{ $isoTimestamp }}"
            status: "{{ $randomInt(0, 1) === 0 ? 'present' : 'absent' }}"
            notes: "Load test bulk entry {{ $randomInt(1, 100) }}"
          expect:
            - statusCode: 201

  - name: "Class Session Attendance Recording"
    weight: 25
    flow:
      - post:
          url: "/api/attendance/bulk"
          headers:
            Authorization: "Bearer {{ auth_token }}"
          json:
            classSessionId: "{{ $randomInt(1, 50) }}"
            records: [
              { studentId: "{{ $randomInt(1, 1000) }}", status: "present", entryTime: "{{ $isoTimestamp }}" },
              { studentId: "{{ $randomInt(1, 1000) }}", status: "present", entryTime: "{{ $isoTimestamp }}" },
              { studentId: "{{ $randomInt(1, 1000) }}", status: "absent", entryTime: "{{ $isoTimestamp }}" }
            ]
          expect:
            - statusCode: 201

  # RFID/IoT device scenarios - high frequency during device connection phases
  - name: "RFID Scan Simulation - Entry"
    weight: 20
    flow:
      - post:
          url: "/api/attendance/rfid-scan"
          headers:
            Authorization: "Bearer {{ auth_token }}"
          json:
            rfidUid: "RFID{{ $randomInt(100000, 999999) }}"
            deviceId: "device_{{ $randomInt(1, 20) }}"
            location: "gate_{{ $randomInt(1, 5) }}"
            timestamp: "{{ $isoTimestamp }}"
          expect:
            - statusCode: 200

  - name: "RFID Scan Simulation - Exit"
    weight: 15
    flow:
      - post:
          url: "/api/attendance/rfid-scan"
          headers:
            Authorization: "Bearer {{ auth_token }}"
          json:
            rfidUid: "RFID{{ $randomInt(100000, 999999) }}"
            deviceId: "device_{{ $randomInt(1, 20) }}"
            location: "exit_{{ $randomInt(1, 3) }}"
            timestamp: "{{ $isoTimestamp }}"
            direction: "exit"
          expect:
            - statusCode: 200

  - name: "IoT Device Heartbeat"
    weight: 30
    flow:
      - post:
          url: "/api/iot/heartbeat"
          headers:
            Authorization: "Bearer {{ auth_token }}"
          json:
            deviceId: "iot_device_{{ $randomInt(1, 50) }}"
            batteryLevel: "{{ $randomInt(10, 100) }}"
            signalStrength: "{{ $randomInt(-50, -20) }}"
            lastScan: "{{ $isoTimestamp }}"
            temperature: "{{ $randomInt(20, 30) }}"
          expect:
            - statusCode: 200

  # Dashboard and reporting - moderate usage
  - name: "Real-time Dashboard Data"
    weight: 12
    flow:
      - get:
          url: "/api/dashboard/realtime"
          headers:
            Authorization: "Bearer {{ auth_token }}"
          expect:
            - statusCode: 200

  - name: "Attendance Reports"
    weight: 8
    flow:
      - get:
          url: "/api/reports/attendance"
          headers:
            Authorization: "Bearer {{ auth_token }}"
          qs:
            classId: "{{ $randomInt(1, 20) }}"
            date: "{{ $isoTimestamp }}"
            format: "json"
          expect:
            - statusCode: 200

  # Student/Staff management - lower frequency
  - name: "Student Search and Filter"
    weight: 6
    flow:
      - get:
          url: "/api/students"
          headers:
            Authorization: "Bearer {{ auth_token }}"
          qs:
            search: "student{{ $randomInt(1, 100) }}"
            grade: "{{ $randomInt(1, 12) }}"
            limit: 25
            page: "{{ $randomInt(1, 5) }}"
          expect:
            - statusCode: 200

  - name: "Class Roster View"
    weight: 10
    flow:
      - get:
          url: "/api/classrooms/{{ $randomInt(1, 20) }}/students"
          headers:
            Authorization: "Bearer {{ auth_token }}"
          expect:
            - statusCode: 200

  # Mobile app scenarios
  - name: "Mobile Attendance Check"
    weight: 18
    flow:
      - get:
          url: "/api/mobile/attendance-status"
          headers:
            Authorization: "Bearer {{ auth_token }}"
            User-Agent: "MobileApp/1.0 (iOS)"
          expect:
            - statusCode: 200

  # System monitoring - always running
  - name: "Health Check"
    weight: 5
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200

  - name: "System Metrics"
    weight: 3
    flow:
      - get:
          url: "/metrics"
          headers:
            Authorization: "Bearer prometheus"
          expect:
            - statusCode: 200

# Performance thresholds - adjusted for realistic load testing
ensure:
  p95: 2000  # 95th percentile response time < 2 seconds (more realistic for high load)
  p99: 5000  # 99th percentile response time < 5 seconds
  rps: 100   # Minimum 100 requests per second during peak loads

# Custom metrics for business KPIs
metrics:
  - name: "Attendance Records Created"
    capture: json: "$..attendanceRecordsCreated"
  - name: "RFID Scans Processed"
    capture: json: "$..rfidScansProcessed"
  - name: "IoT Heartbeats Received"
    capture: json: "$..iotHeartbeatsReceived"
  - name: "Failed Authentications"
    capture: json: "$..failedAuthentications"
  - name: "Database Connection Pool Usage"
    capture: json: "$..dbConnectionPoolUsage"